In [1]:
import pandas as pd
import numpy

In [2]:
data=pd.read_csv("Main_data.csv", sep='\t')

In [3]:
data.head()

        player_id;dt;battles;revenue
0  1615792575;06.05.2017;126;1795.93
1   5175944443;26.05.2017;99;1226.65
2    8291614094;18.03.2017;11;887.56
3   6911048278;01.05.2017;223;199.95
4    4980885953;17.03.2018;84;199.03

In [4]:
df = data['player_id;dt;battles;revenue'].str.split(';', n=3, expand=True).rename(columns={0:"player_id", 1:"dt", 2:"battles", 3:"revenue" })
df

         player_id          dt battles  revenue
0       1615792575  06.05.2017     126  1795.93
1       5175944443  26.05.2017      99  1226.65
2       8291614094  18.03.2017      11   887.56
3       6911048278  01.05.2017     223   199.95
4       4980885953  17.03.2018      84   199.03
...            ...         ...     ...      ...
551011  7547441726  09.05.2017       8        0
551012  5055614135  19.05.2017      10        0
551013  3860757360  26.05.2017     181        0
551014  2089935018  22.03.2017       1        0
551015  7816860835  12.05.2017       2        0

[551016 rows x 4 columns]

In [5]:
df.sort_values(by='revenue', ascending=False)

         player_id          dt battles revenue
978     1061875936  12.04.2019     104   99.81
979     2799156280  12.04.2018     176   99.72
980     2387075704  20.05.2018      67   99.69
981     7042488066  07.03.2018     153   99.64
982     7486650512  29.04.2018      93   99.61
...            ...         ...     ...     ...
190066  4697511590  19.03.2017       4       0
190065  8640094879  18.03.2017      26       0
190064  8270488310  23.03.2017      90       0
190063  6851526776  13.05.2017       2       0
551015  7816860835  12.05.2017       2       0

[551016 rows x 4 columns]

In [6]:
df['revenue'] = df['revenue'].astype(float)
df.dtypes

player_id     object
dt            object
battles       object
revenue      float64
dtype: object

In [7]:
print(df.dtypes)

player_id     object
dt            object
battles       object
revenue      float64
dtype: object

In [8]:
df['revenue'].astype(str).astype(float)

0         1795.93
1         1226.65
2          887.56
3          199.95
4          199.03
           ...
551011       0.00
551012       0.00
551013       0.00
551014       0.00
551015       0.00
Name: revenue, Length: 551016, dtype: float64

In [9]:
df['revenue'].max()

1795.93

In [10]:
df['revenue'].mean()

0.6276426092890243

In [11]:
df2 = df[df.revenue != 0]

In [12]:
df2['revenue'].mean()

36.02136444120414

In [22]:
No = df2['revenue'].count()